-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Фев 09 2021 г., 19:19
-- Версия сервера: 10.3.22-MariaDB
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `jokgrom_morskie`
--

-- --------------------------------------------------------

--
-- Структура таблицы `city`
--

CREATE TABLE `city` (
  `id` int(11) NOT NULL,
  `title` varchar(50) NOT NULL,
  `parent_city_id` int(11) DEFAULT NULL,
  `addressLatitude` varchar(25) DEFAULT NULL,
  `addressLongitude` varchar(25) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `city`
--

INSERT INTO `city` (`id`, `title`, `parent_city_id`, `addressLatitude`, `addressLongitude`) VALUES
(1, 'Анапа', NULL, '44.894965', '37.316170'),
(2, 'Геленджик', NULL, '44.561006', '38.077115'),
(3, 'Новороссийск', NULL, '44.723771', '37.768804'),
(4, 'Сочи', NULL, '43.585472', '39.723089'),
(5, 'Темрюк', NULL, '45.282044', '37.365379'),
(6, 'Туапсе', NULL, '44.094637', '39.073095'),
(7, 'Архипо-Осиповка', 2, '44.3701', '38.533396'),
(8, 'Кабардинка', 2, '44.651485', '37.938316'),
(9, 'Дивноморское', 2, '44.499768', '38.137311'),
(10, 'Марьина Роща', 2, '44.619074', '38.029297'),
(11, 'Береговое', 2, '44.419855', '38.359913'),
(12, 'Бетта', 2, '44.372632', '38.39077'),
(13, 'Тешебс', 2, '44.37231', '38.589082'),
(14, 'Светлый', 2, '44.550177', '38.141865'),
(15, 'Джанхот', 2, '44.466255', '38.160882'),
(16, 'Прасковеевка', 2, '44.474039', '38.217836'),
(17, 'Виноградное', 2, '44.640371', '38.003884'),
(18, 'Криница', 2, '44.382837', '38.348702'),
(19, 'Абрау-Дюрсо', 3, '44.698622', '37.603029'),
(20, 'Глебовское', 3, '44.710282', '37.643507'),
(21, 'Дюрсо', 3, '44.734369', '37.564608'),
(22, 'Мысхако', 3, '44.657294', '37.760521'),
(23, 'Северная Озереевка', 3, '44.697437', '37.632179'),
(24, 'Федотовка', 3, '44.677616', '37.711249'),
(25, 'Широкая Балка', 3, '44.663237', '37.685108'),
(26, 'Южная Озереевка', 3, '44.673827', '37.632026'),
(27, 'Джубга', 6, '44.314735', '38.701623'),
(28, 'Лермонтово', 6, '44.302054', '38.753249'),
(29, 'Сосновый', 6, '44.17669', '38.945642'),
(30, 'Майский', 6, '44.100204', '39.069519'),
(31, 'Тенгинка', 6, '44.32388', '38.781816'),
(32, 'Пляхо', 6, '44.271203', '38.83134'),
(33, 'Новомихайловский', 6, '44.252398', '38.846549'),
(34, 'Ольгинка', 6, '44.200198', '38.889533'),
(35, 'Тюменский', 6, '44.180885', '38.975816'),
(36, 'Небуг', 6, '44.17113', '39.002065'),
(37, 'Агой', 6, '44.146911', '39.040225'),
(38, 'Агуй-Шапсуг', 6, '44.18128', '39.068513'),
(39, 'Шепси', 6, '44.041778', '39.149631'),
(40, 'Гизель-Дере', 6, '44.066196', '39.11324'),
(41, 'Дедеркой', 6, '44.052119', '39.127937'),
(42, 'Артющенко', 5, '45.135396', '36.812736'),
(43, 'Ахтанизовская', 5, '45.32069', '37.101742'),
(44, 'Батарейка', 5, '45.39265', '36.824791'),
(45, 'Береговой', 5, '45.355529', '36.818395'),
(46, 'Веселовка', 5, '45.129177', '36.904615'),
(47, 'Виноградный', 5, '45.27541', '37.40257'),
(48, 'Волна', 5, '45.126793', '36.713041'),
(49, 'Волна Революции', 5, '45.332863', '36.948157'),
(50, 'Вышестеблиевская', 5, '45.193614', '36.997977'),
(51, 'Гаркуша', 5, '45.319733', '36.855262'),
(52, 'Голубицкая', 5, '45.323314', '37.274955'),
(53, 'За Родину', 5, '45.350063', '37.107338'),
(54, 'Запорожская', 5, '45.379161', '36.866545'),
(55, 'Ильич', 5, '45.420714', '36.770946'),
(56, 'Красноармейский', 5, '45.395061', '36.871414'),
(57, 'Кучугуры', 5, '45.408503', '36.953232'),
(58, 'Октябрьский', 5, '45.248613', '37.327524'),
(59, 'Пересыпь', 5, '45.347599', '37.127452'),
(60, 'Приазовский', 5, '45.441984', '36.840143'),
(61, 'Приморский', 5, '45.263681', '36.912628'),
(62, 'Прогресс', 5, '45.165393', '36.837996'),
(63, 'Сенной', 5, '45.286223', '36.994249'),
(64, 'Солёный', 5, '45.266536', '37.031781'),
(65, 'Таманский', 5, '45.1467', '36.78708'),
(66, 'Тамань', 5, '45.215606', '36.718413'),
(68, 'Фонталовская', 5, '45.366035', '36.933883'),
(69, 'Юбилейный', 5, '45.331951', '36.984907'),
(70, 'Чембурка', 1, '44.929064', '37.339786'),
(71, 'Варваровка', 1, '44.826257', '37.367481'),
(72, 'Су-Псех', 1, '44.860787', '37.358238'),
(73, 'Гай-Кодзор', 1, '44.854398', '37.437739'),
(74, 'Анапская', 1, '44.900341', '37.381288'),
(75, 'Бужор', 1, '44.857088', '37.413682'),
(76, 'Просторный', 1, '44.931126', '37.375701'),
(77, 'Виноградный', 1, '45.05669', '37.320634'),
(78, 'Пятихатки', 1, '44.975534', '37.304518'),
(79, 'Джигинка', 1, '45.130907', '37.335295'),
(80, 'Джемете', 1, '44.949481', '37.303611'),
(81, 'Усатова Балка', 1, '44.89379', '37.424506'),
(82, 'Цыбанобалка', 1, '44.978384', '37.333741'),
(83, 'Песчаный', 1, '45.017754', '37.296173'),
(84, 'Красный', 1, '44.945341', '37.34399'),
(90, 'Витязево', 1, '45.002359', '37.283803'),
(91, 'Благовещенская', 1, '45.055792', '37.131763'),
(92, 'Большой Утриш', 1, '44.76091', '37.386427'),
(93, 'Воскресенский', 1, '44.965446', '37.32279'),
(94, 'Сукко', 1, '44.791297', '37.402255'),
(101, 'Алексеевское', 4, '43.938548', '39.381199'),
(102, 'Ахштырь', 4, '43.51007', '40.000417'),
(103, 'Барановка', 4, '43.709217', '39.687318'),
(104, 'Беранда', 4, '43.770986', '39.525917'),
(105, 'Бестужевское', 4, '43.482701', '39.943481'),
(106, 'Богушёвка', 4, '43.602043', '39.778551'),
(107, 'Большой Кичмай', 4, '43.834512', '39.510646'),
(108, 'Варваровка', 4, '43.692611', '39.700667'),
(109, 'Вардане-Верино', 4, '43.499078', '39.942888'),
(110, 'Васильевка', 4, '43.663337', '39.716360'),
(111, 'Верхнеармянская Хобза', 4, '43.746173', '39.600594'),
(112, 'Верхнеармянское Лоо', 4, '43.736710', '39.617977'),
(113, 'Верхневесёлое', 4, '43.425170', '39.979549'),
(114, 'Верхнее Буу', 4, '43.757842', '39.557412'),
(115, 'Верхнее Учдере', 4, '43.700510', '39.638162'),
(116, 'Верхнеякорная Щель', 4, '43.779383', '39.513673'),
(117, 'Верхний Юрт', 4, '43.634061', '39.770106'),
(119, 'Весёлое', 4, '43.417470', '40.007396'),
(120, 'Волковка', 4, '43.694064', '39.662228'),
(121, 'Высокое', 4, '43.480104', '39.971922'),
(122, 'Горное Лоо', 4, '43.716951', '39.60761'),
(123, 'Детляжка', 4, '43.760987', '39.535574'),
(124, 'Дубравный', 4, '43.515954', '39.891972'),
(125, 'Зубова Щель', 4, '43.839324', '39.442096'),
(126, 'Каткова Щель', 4, '43.858652', '39.415694'),
(127, 'Каштаны', 4, '43.524471', '39.901000'),
(128, 'Малый Кичмай', 4, '43.821447', '39.499345'),
(129, 'Молдовка', 4, '43.465993', '39.961232'),
(130, 'Нижнее Учдере', 4, '43.686822', '39.616090'),
(131, 'Ордынка', 4, '43.687468', '39.687479'),
(132, 'Орёл-Изумруд', 4, '43.467328', '39.925497'),
(133, 'Раздольное', 4, '43.588528', '39.769630'),
(134, 'Русская Мамайка', 4, '43.647494', '39.718795'),
(135, 'Сергей-Поле', 4, '43.680147', '39.710683'),
(136, 'Татьяновка', 4, '43.959939', '39.410682'),
(137, 'Черешня', 4, '43.449162', '39.985226'),
(138, 'Волконка', 4, '43.880221', '39.403639'),
(139, 'Лазаревское', 4, '43.908434', '39.333373'),
(140, '1центральный район', 1, '44.894965', '37.316170'),
(141, '1центральный район', 2, '44.561006', '38.077115'),
(142, '1центральный район', 3, '44.723771', '37.768804'),
(143, '1центральный район', 4, '43.585472', '39.723089'),
(144, '1центральный район', 5, '45.282044', '37.365379'),
(145, '1центральный район', 6, '44.094637', '39.073095'),
(146, 'Адлер', 4, '43.438166', '39.911178');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `city`
--
ALTER TABLE `city`
  ADD PRIMARY KEY (`id`),
  ADD KEY `city_city_id_fk` (`parent_city_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `city`
--
ALTER TABLE `city`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=147;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `city`
--
ALTER TABLE `city`
  ADD CONSTRAINT `city_city_id_fk` FOREIGN KEY (`parent_city_id`) REFERENCES `city` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
